import config, telebot
token = config.token
bot = telebot.TeleBot(token)
# s = "416302354 291552073 314358664 514295242 498618002 548680334 540420897 486463704 488866146 447973019 314145584 428401414 326908373 152864095 496168273 450499651 476740643 478322073 396801629 465949389 514657034 201443414 146716415 "
# kek = s.split()

# l = kek
# print(l)
# l = [1]

bot.send_message()
print("Отправлено: ", )
# for i in l:
# 	# bot.send_message(i, "    Привет, Ты!\n    Небольшой спам от разработчиков этого бота. Такое будет происходит очень редко, а может и не будет вовсе(но это не точно).\n    Первое: сегодня в боте появилась новая кнопка, которая говорит, сколько осталось до звонка(наверное самое полезное что есть в этом боте...)\n    Второе: бот пока в бете и поэтому он может переодически падать(но он на все потом ответит и поэтому спамить командами не рекомендуется).  скорее всего это будет редко происходить (мы то верим (хотим верить) в себя)\n    Третье: если у тебя,  терпиливый, благодарный и  любимый  нами юзер, который дочитал этот текст до конца, есть какие-то вопросы, предложения,  нарекания касательно работы бота, рассписания или тебе просто скучно - обязательно напиши нам вот сюда @nekolhir или @dugeru42 .\n    Спасибо за внимание. Спокойно ночи! 😊" )
# 	print("Отправлено: ", i)
