# -*- coding: utf-8 -*-
timeles = [
	{
		"начало": {
		    "1": "08:00:00",
		    "2": "08:50:00",
		    "3": "09:45:00",
		    "4": "10:40:00",
		    "5": "11:35:00",
		    "6": "12:30:00",
		    "7": "13:20:00",
		    "8": "14:15:00",
		    "9": "15:05:00",
		    "10": "15:55:00"
	  	},
	  	"конец": {
		    "1": "08:40:00",
		    "2": "09:30:00",
		    "3": "10:25:00",
		    "4": "11:20:00",
		    "5": "12:15:00",
		    "6": "13:10:00",
		    "7": "14:00:00",
		    "8": "14:55:00",
		    "9": "15:45:00",
		    "10": "16:35:00"
	  	}
	},
	{
		"начало": {
        "1": "08:00:00",
        "2": "08:45:00",
        "3": "09:30:00",
        "4": "10:20:00",
        "5": "11:10:00",
        "6": "12:00:00",
        "7": "12:50:00",
        "8": "13:35:00",
        "9": "14:20:00",
        "10":"15:05:00"
      },
      "конец": {
        "1": "08:40:00",
        "2": "09:25:00",
        "3": "10:10:00",
        "4": "11:00:00",
        "5": "11:50:00",
        "6": "12:40:00",
        "7": "13:30:00",
        "8": "14:15:00",
        "9": "15:00:00",
        "10":"16:30:00"
      }
	}
]

tt = {
"10А":
{
   "Понедельник": {
	   "1": "Алгебра",
	   "2": "Алгебра",
	   "3": "Технология",
	   "4": "Обществознание",
	   "5": "Физика",
	   "6": "Физика",
	   "7": "Доп. По русскому",
	   "8": "Доп. По русскому",
	   "9": "",
	   "10": ""
   		},
 	"Вторник": {
	   "1": "Информатика",
	   "2": "Информатика",
	   "3": "Физ-ра",
	   "4": "Алгебра",
	   "5": "Алгебра",
	   "6": "Литература",
	   "7": "Математика",
	   "8": "Математика",
	   "9": "Математика",
	   "10": "Математика"
  		},
 	"Среда":{
	   "1": "Обж",
	   "2": "Литература",
	   "3": "География",
	   "4": "Физ-ра",
	   "5": "История России",
	   "6": "Химия",
	   "7": "Программирование",
	   "8": "Программирование",
	   "9": "",
	   "10": ""
   		},
	"Четверг":{
	   "1": "Физ-ра",
	   "2": "Всеобщая История",
	   "3": "Алгебра",
	   "4": "Алгебра",
	   "5": "Английский язык",
	   "6": "Физика",
	   "7": "Физика",
	   "8": "Физика",
	   "9": "",
	   "10": ""
	   },
	"Пятница":{
	   "1": "Геометрия",
	   "2": "Геометрия",
	   "3": "Обществознание",
	   "4": "Английский язык",
	   "5": "Физика",
	   "6": "Физика",
	   "7": "Классный час",
	   "8": "",
	   "9": "",
	   "10": ""
	   },
	"Суббота":{
	   "1": "Английский язык",
	   "2": "Биология",
	   "3": "Рус.яз",
	   "4": "Литература",
	   "5": "Физика.... Крепитесь ребята",
	   "6": "",
	   "7": "",
	   "8": "",
	   "9": "",
	   "10": ""
	   }
 },
 "9Б":
{
   "Понедельник": {
	   "1": "История",
	   "2": "Русский язык",
	   "3": "Литература",
	   "4": "География",
	   "5": "Обществознание",
	   "6": "",
	   "7": "",
	   "8": "",
	   "9": "",
	   "10": ""
   		},
 	"Вторник": {
	   "1": "физика",
	   "2": "ИЗО/музыка",
	   "3": "География",
	   "4": "Физ-ра",
	   "5": "Алгебра",
	   "6": "Алгебра",
	   "7": "Рус.яз ДОП",
	   "8": "",
	   "9": "",
	   "10": ""
  		},
 	"Среда":{
	   "1": "Физика",
	   "2": "Литература",
	   "3": "Физ-ра",
	   "4": "Биология",
	   "5": "Алгебра",
	   "6": "Геометрия",
	   "7": "Англ. яз",
	   "8": "Алгебра ДОП",
	   "9": "",
	   "10": ""
   		},
	"Четверг":{
	   "1": "Информатика",
	   "2": "Информатика",
	   "3": "Литература",
	   "4": "Русский язык",
	   "5": "Английский язык",
	   "6": "Геометрия",
	   "7": "Алгебра ЗФТШ",
	   "8": "Алгебра ЗФТШ",
	   "9": "",
	   "10": ""
	   },
	"Пятница":{
	   "1": "Алгебра",
	   "2": "Химия",
	   "3": "Биология",
	   "4": "Английский язык",
	   "5": "Физ-ра",
	   "6": "Физика",
	   "7": "",
	   "8": "",
	   "9": "",
	   "10": ""
	   },
	"Суббота":{
	   "1": "Технология",
	   "2": "Всеобщая история",
	   "3": "Химия",
	   "4": "Алгебра",
	   "5": "Геометрия",
	   "6": "Информатика ДОП",
	   "7": "Инофрматика ДОП",
	   "8": "Классный час",
	   "9": "",
	   "10": ""
	   }
 },
 "10В":
{
   "Понедельник": {
	   "1": "",
	   "2": "Русский язык",
	   "3": "Литература",
	   "4": "Ист. России",
	   "5": "Обществознание",
	   "6": "",
	   "7": "",
	   "8": "",
	   "9": "",
	   "10": ""
   		},
 	"Вторник": {
	   "1": "Технология",
	   "2": "Английский",
	   "3": "Алгебра",
	   "4": "Физика",
	   "5": "Физ-ра",
	   "6": "",
	   "7": "",
	   "8": "",
	   "9": "",
	   "10": ""
  		},
 	"Среда":{
	   "1": "Химия",
	   "2": "Алгебра",
	   "3": "Обж",
	   "4": "Литература",
	   "5": "Физ-ра",
	   "6": "Физика",
	   "7": "Физика",
	   "8": "Физика",
	   "9": "",
	   "10": ""
   		},
	"Четверг":{
	   "1": "Английский",
	   "2": "Физика",
	   "3": "Обществознание",
	   "4": "Физ-ра",
	   "5": "География",
	   "6": "Информатика",
	   "7": "Математика",
	   "8": "Русский язык",
	   "9": "Русский язык",
	   "10": ""
	   },
	"Пятница":{
	   "1": "Физика",
	   "2": "Алгебра",
	   "3": "Геометрия",
	   "4": "Всеобщая История",
	   "5": "Литература",
	   "6": "Информатика",
	   "7": "Информатика",
	   "8": "Информатика",
	   "9": "",
	   "10": ""
	   },
	"Суббота":{
	   "1": "",
	   "2": "Английский",
	   "3": "Алгебра",
	   "4": "Геометрия",
	   "5": "Биология",
	   "6": "Физика",
	   "7": "Астрономия",
	   "8": "",
	   "9": "",
	   "10": ""
	   }
 },

 "9А":
	{
		"Понедельник": {
		"1": "География",
		"2": "Обществознание",
		"3": "Алгебра",
		"4": "Физика",
		"5": "Литература",
		"6": "История России",
		"7": "Доп. Математика",
		"8": "Доп. Математика",
		"9": "",
		"10": ""
		},
		"Вторник": {
		"1": "ИЗО/Музыка",
		"2": "Технология",
		"3": "Информатика",
		"4": "Информатика",
		"5": "Алгебра",
		"6": "Геометрия",
		"7": "Физика",
		"8": "Физика",
		"9": "Физика",
		"10": ""
		},
		"Среда":{
		"1": "Физ-ра",
		"2": "Биология",
		"3": "Английский язык",
		"4": "География",
		"5": "Русский язык",
		"6": "Литература",
		"7": "",
		"8": "",
		"9": "",
		"10": ""
		},
		"Четверг":{
		"1": "Алгебра",
		"2": "Геометрия",
		"3": "Физ-ра",
		"4": "Английский язык",
		"5": "Физика",
		"6": "Химия",
		"7": "",
		"8": "Программирование",
		"9": "Программирование",
		"10": ""
		},
		"Пятница":{
		"1": "Доп.Русский",
		"2": "Русский",
		"3": "Литература",
		"4": "Химия",
		"5": "Биология",
		"6": "Алгебра",
		"7": "Английский язык",
		"8": "ЗФТШ",
		"9": "ЗФТШ",
		"10": ""
		},
		"Суббота":{
		"1": "Всеобщая история",
		"2": "Алгебра",
		"3": "Геометрия",
		"4": "Предпрофиль",
		"5": "Физ-ра",
		"6": "Физика*",
		"7": "",
		"8": "",
		"9": "",
		"10": ""
		}
	}
}
