# -*- coding: utf-8 -*-
# token = '473730851:AAH0YStH_8HEkzBU0SBq-XdrtXJUXGKbsw4'
token = '514174347:AAGGSeGNGlXUjocpkYVXuYJf_YSnTEe4cOQ'
timeles = [
	{
		"начало": { 
			"1":"08:30:00",
			"2":"09:25:00",
			"3":"10:25:00",
			"4":"11:25:00",
			"5":"12:25:00",
			"6":"13:15:00",
			"7":"14:05:00",
			"8": "14:15:00",
		    "9": "15:05:00",
		    "10": "15:55:00"
		},
		"конец": { 
			"1":"09:15:00", 
			"2":"10:05:00", 
			"3":"11:05:00", 
			"4":"12:05:00", 
			"5":"13:05:00", 
			"6":"13:55:00", 
			"7":"14;45:00", 
			"8": "14:15:00",
		    "9": "15:05:00",
		    "10": "15:55:00"
		}
	},
	{
		"начало": { 
			"1":"08:00:00", 
			"2":"08:50:00", 
			"3":"09:50:00", 
			"4":"10:50:00", 
			"5":"11:40:00", 
			"6":"12:30:00", 
			"7":"13:30:00", 
			"8":"14:20:00", 
			"8": "14:15:00",
		    "9": "15:05:00",
		    "10": "15:55:00"
		}, 
		"конец": { 
			"1":"08:40:00", 
			"2":"09:30:00", 
			"3":"10:30:00", 
			"4":"11:30:00", 
			"5":"12:20:00", 
			"6":"13:10:00", 
			"7":"14:10:00", 
			"8": "14:15:00",
		    "9": "15:05:00",
		    "10": "15:55:00"
		}
	}
]

tt = {
"10А":
	{
		"Понедельник": {
		"1":"Литература",
		"2":"Английский язык""Немецкий язык",
		"3": "Обществознание",
		"4":"Астрономия",
		"5":"Физика",
		"6":"Физическая культура",
		"7":"Биология",
		"8":"",
		"9":"",
		"10":""
		},
		"Вторник": {
		"1":"География",
		"2":"Немецкий язык""Английский язык",
		"3":"Физика",
		"4":"Литература",
		"5":"Алгебра и начала анализа",
		"6":"Алгебра и начала анализа",
		"7":"Технология 1 группа""Технология 2 группа",
		"8":"",
		"9":"",
		"10":""
		},
		"Среда":{
		"1":"Алгебра и начала анализа",
		"2":"Геометрия",
		"3":"Всеобщая история",
		"4":"Русский язык",
		"5":"Физика",
		"6":"Физика",
		"7":"Физическая культура",
		"8":"",
		"9":"",
		"10":""
		},
		"Четверг":{
		"1":"Геометрия",
		"2":"Геометрия",
		"3":"Химия",
		"4":"ОБЖ",
		"5":"Информатика и ИКТ",
		"6":"История России",
		"7":"Обществознание",
		"8":"",
		"9":"",
		"10":""
		},
		"Пятница":{
		"1":"Немецкий язык""Английский язык",
		"2":"Литература",
		"3":"Алгебра и начала анализа",
		"4":"Алгебра и начала анализа",
		"5":"Физика",
		"6":"Физическая культура",
		"7":"", 
		"8":"", 
		"9":"", 
		"10":"" 
		}, 
		"Суббота":{} 
	} 
}
