# -*- coding: utf-8 -*-
# token = '473730851:AAH0YStH_8HEkzBU0SBq-XdrtXJUXGKbsw4'
token = '514174347:AAGGSeGNGlXUjocpkYVXuYJf_YSnTEe4cOQ'
timeles = [
	{
		"начало": { 
			"1": "08:00:00", 
			"2": "08:50:00", 
			"3": "09:50:00", 
			"4": "10:50:00", 
			"5": "11:40:00", 
			"6": "12:30:00", 
			"7": "13:30:00", 
			"8": "14:20:00", 
			"9": "", 
			"10": "" 
		}, 
		"конец": { 
			"1": "08:40:00", 
			"2": "09:30:00", 
			"3": "10:30:00", 
			"4": "11:30:00", 
			"5": "12:20:00", 
			"6": "13:10:00", 
			"7": "14:10:00", 
			"8": "15:00:00", 
			"9": "", 
			"10": "" 
		}
	},
	{
		"начало": { 
			"1": "08:00:00", 
			"2": "08:50:00", 
			"3": "09:50:00", 
			"4": "10:50:00", 
			"5": "11:40:00", 
			"6": "12:30:00", 
			"7": "13:30:00", 
			"8": "14:20:00", 
			"9": "", 
			"10": "" 
		}, 
		"конец": { 
			"1": "08:40:00", 
			"2": "09:30:00", 
			"3": "10:30:00", 
			"4": "11:30:00", 
			"5": "12:20:00", 
			"6": "13:10:00", 
			"7": "14:10:00", 
			"8": "15:00:00", 
			"9": "", 
			"10": "" 
		}
	}
]

tt = {
"10А Не химики": 
	{ 
		"Понедельник": { 
		"1": "Технология", 
		"2": "Русский язык", 
		"3": "ОБЖ", 
		"4": "Физика", 
		"5": "Английский язык", 
		"6": "Литература", 
		"7": "Практикум по русскому", 
		"8": "", 
		"9": "", 
		"10": "" 
		}, 
		"Вторник": { 
		"1": "Обществознание (П/Э)", 
		"2": "Английский язык", 
		"3": "Алгебра", 
		"4": "Алгебра", 
		"5": "Физ-ра", 
		"6": "П/Э", 
		"7": "Обществознание", 
		"8": "Практикум по биологии", 
		"9": "", 
		"10": "" 
		}, 
		"Среда":{ 
		"1": "История", 
		"2": "Обществознание", 
		"3": "История", 
		"4": "История", 
		"5": "Информатика", 
		"6": "Физ-ра", 
		"7": "Обществознание", 
		"8": "", 
		"9": "", 
		"10": "" 
		}, 
		"Четверг":{ 
		"1": "История", 
		"2": "Обществознание", 
		"3": "Обществознание", 
		"4": "Геометрия", 
		"5": "Геометрия", 
		"6": "Английский язык", 
		"7": "История", 
		"8": "", 
		"9": "", 
		"10": "" 
		}, 
		"Пятница":{ 
		"1": "География", 
		"2": "История", 
		"3": "Физика", 
		"4": "Литература", 
		"5": "Литература", 
		"6": "Физ-ра", 
		"7": "Практикум по математике", 
		"8": "Классный час", 
		"9": "", 
		"10": "" 
		}, 
		"Суббота":{} 
	},
	"10А Химики": 
	{ 
		"Понедельник": { 
		"1": "Технология", 
		"2": "Русский язык", 
		"3": "ОБЖ", 
		"4": "Физика", 
		"5": "Английский язык", 
		"6": "Литература", 
		"7": "Практикум по русскому", 
		"8": "", 
		"9": "", 
		"10": "" 
		}, 
		"Вторник": { 
		"1": "Химия", 
		"2": "Английский язык", 
		"3": "Алгебра", 
		"4": "Алгебра", 
		"5": "Физ-ра", 
		"6": "Биология", 
		"7": "Биология", 
		"8": "Практикум по биологии", 
		"9": "", 
		"10": "" 
		}, 
		"Среда":{ 
		"1": "", 
		"2": "Обществознание или Химия", 
		"3": "Химия", 
		"4": "Химия", 
		"5": "Информатика", 
		"6": "Физ-ра", 
		"7": "", 
		"8": "", 
		"9": "", 
		"10": "" 
		}, 
		"Четверг":{ 
		"1": "", 
		"2": "Биология", 
		"3": "Биология", 
		"4": "Геометрия", 
		"5": "Геометрия", 
		"6": "Английский язык", 
		"7": "", 
		"8": "", 
		"9": "", 
		"10": "" 
		}, 
		"Пятница":{ 
		"1": "География", 
		"2": "Химия", 
		"3": "Физика", 
		"4": "Литература", 
		"5": "Литература", 
		"6": "Физ-ра", 
		"7": "Практикум по математике", 
		"8": "Классный час", 
		"9": "", 
		"10": "" 
		}, 
		"Суббота":{} 
	},
}